ams/src/DataProcessors/AMS_Продажи/AMS_Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_Продажи</name>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продажи</name>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>СостоянияЗаказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтгрузкаТоваровКлиенту</types>
      </type>
    </attributes>
    <attributes>
      <name>СостоянияРеализация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерРеализация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализация</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловияОтгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИзмененаЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИзмененаРеализация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>В2В</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПросроченЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПросроченРеализация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Лимит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛимит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолгКлиентаПросрочен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолгНаш</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденаОтгрузка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сальдо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьСН</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьУПД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЛист</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ams/src/Enums/AMS_СобытияРеализации/AMS_СобытияРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СобытияРеализации</name>
  <enumValues>
    <name>Запись</name>
  </enumValues>
  <enumValues>
    <name>Проведение</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПроведения</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтменаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПогрузки</name>
  </enumValues>
  <enumValues>
    <name>РазрешитьОтгрузку</name>
  </enumValues>
  <enumValues>
    <name>ОтменаРазрешенияОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ПечатьСН</name>
  </enumValues>
  <enumValues>
    <name>ПечатьТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ПечатьУПД</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПечати</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/AMS_СтатусыРеализаций/AMS_СтатусыРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СтатусыРеализаций</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Стикерование</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоРаспискеЭкспедитора</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоУПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов_УПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоУПДестьТНнет</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаБезДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ_12_Удалить</name>
  </enumValues>
</mdclass:Enum>

ams/src/DataProcessors/AMS_Продажи/Forms/ФормаПечать/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = мср.ПолучитьРабочийДень(1);
	
	ЗаполнитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтгрузка

&НаКлиенте
Процедура ОтгрузкаУПДПриИзменении(Элемент)
	Стр = Элементы.Отгрузка.ТекущиеДанные;
	ИзменитьРеквизитПартнера(Стр.Клиент,"_КолЭкзУПД",Стр._КолЭкзУПД);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаТОРГ12ПриИзменении(Элемент)
	Стр = Элементы.Отгрузка.ТекущиеДанные;
	ИзменитьРеквизитПартнера(Стр.Клиент,"_КолЭкзТОРГ12",Стр._КолЭкзТОРГ12);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаСчетФактураПриИзменении(Элемент)
	Стр = Элементы.Отгрузка.ТекущиеДанные;
	ИзменитьРеквизитПартнера(Стр.Клиент,"_КолЭкзСФ",Стр._КолЭкзСФ);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаСчетПриИзменении(Элемент)
	Стр = Элементы.Отгрузка.ТекущиеДанные;
	ИзменитьРеквизитПартнера(Стр.Клиент,"_КолЭкзСЧ",Стр._КолЭкзСЧ);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаТТНПриИзменении(Элемент)
	Стр = Элементы.Отгрузка.ТекущиеДанные;
	ИзменитьРеквизитПартнера(Стр.Клиент,"_КолЭкзТТН",Стр._КолЭкзТТН);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаСпецификацияПриИзменении(Элемент)
	Стр = Элементы.Отгрузка.ТекущиеДанные;
	ИзменитьРеквизитПартнера(Стр.Клиент,"_КолЭкзСпецификация",Стр._КолЭкзСпецификация);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаАктОРасхожденияхПриИзменении(Элемент)
	Стр = Элементы.Отгрузка.ТекущиеДанные;
	ИзменитьРеквизитПартнера(Стр.Клиент,"_КолЭкзАктОРасхождениях",Стр._КолЭкзАктОРасхождениях);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	Для каждого Стр Из Отгрузка Цикл
		Если НЕ Стр.Метка Тогда 
			Продолжить;
		КонецЕсли;
		
		Состояние("Вывод на печать документа: " + Стр.Реализация);
		
		Текст = "Реализация №" + ПолучитьНомерУПД(Стр.Реализация) + " от " + ПолучитьДатаУПД(Стр.Реализация) + ":";
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Стр.Реализация);
		
		СписокОбъектов = Новый СписокЗначений;
		СписокОбъектов.Добавить(Стр.Реализация,"Документ_1");
		
		Если Не Стр.СпособДоставки = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СпособыДоставки.Самовывоз") Тогда
			ТабличныйДокумент = СкладскаяНакладная(МассивОбъектов);
			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент,МассивОбъектов);
			Распечатать(ТабличныеДокументы,СписокОбъектов,1,"Складская накладная");
			Текст = Текст + Символы.ПС + "складская накладная - 1 экз.";
			AMS_ВызовСервера.ЗаписатьСобытиеДокумента(МассивОбъектов[0], ПредопределенноеЗначение("Перечисление.AMS_СобытияРеализации.ПечатьСН"));		
		КонецЕсли;
		
		// Доверенность
		СпособДоставки = ПолучитьСпособДоставки(Стр.Реализация);
		Если СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу") 
			Или СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки") Тогда
			
			ТабличныйДокумент = Доверенность(МассивОбъектов);
			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент,МассивОбъектов);
			Распечатать(ТабличныеДокументы,СписокОбъектов,1,"Доверенность");
			Текст = Текст + Символы.ПС + "доверенность - 1 экз.";
		КонецЕсли;
		
		Если Стр._КолЭкзУПД > 0 Тогда 
			ТабличныйДокумент = УПД(МассивОбъектов);
			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент,МассивОбъектов);
			Распечатать(ТабличныеДокументы,СписокОбъектов,Стр._КолЭкзУПД,"УПД");
			Текст = Текст + Символы.ПС + "УПД - " + Стр._КолЭкзУПД + " экз.";
			AMS_ВызовСервера.ЗаписатьСобытиеДокумента(МассивОбъектов[0], ПредопределенноеЗначение("Перечисление.AMS_СобытияРеализации.ПечатьУПД"));		
		КонецЕсли;
		
		Если Стр._КолЭкзСЧ > 0 Тогда 
			ТабличныйДокумент = Счет(МассивОбъектов);
			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент,МассивОбъектов);
			Распечатать(ТабличныеДокументы,СписокОбъектов,Стр._КолЭкзСЧ,"Счет на оплату");
			Текст = Текст + Символы.ПС + "счет на оплату - " + Стр._КолЭкзСЧ + " экз.";
		КонецЕсли;
		
		Если Стр._КолЭкзАктОРасхождениях > 0 Тогда 
			ТабличныйДокумент = АктОРасхождениях(МассивОбъектов);
			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент,МассивОбъектов);
			Распечатать(ТабличныеДокументы,СписокОбъектов,Стр._КолЭкзАктОРасхождениях,"Акт о расхождениях");
			Текст = Текст + Символы.ПС + "акт о расхождениях - " + Стр._КолЭкзАктОРасхождениях + " экз.";
		КонецЕсли;
		
		Если Стр._КолЭкзТОРГ12 > 0 Тогда 
			ТабличныйДокумент = ТОРГ12(МассивОбъектов);
			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент,МассивОбъектов);
			Распечатать(ТабличныеДокументы,СписокОбъектов,Стр._КолЭкзТОРГ12,"ТОРГ-12");
			Текст = Текст + Символы.ПС + "ТОРГ-12 - " + Стр._КолЭкзТОРГ12 + " экз.";
			AMS_ВызовСервера.ЗаписатьСобытиеДокумента(МассивОбъектов[0], ПредопределенноеЗначение("Перечисление.AMS_СобытияРеализации.ПечатьТОРГ12"));		
		КонецЕсли;
			
		Если Стр._КолЭкзСФ  > 0 Тогда 
			ТабличныйДокумент = СчетФактура(МассивОбъектов);
			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент,МассивОбъектов);
			Распечатать(ТабличныеДокументы,СписокОбъектов,Стр._КолЭкзСФ,"Счет-Фактура");
			Текст = Текст + Символы.ПС + "счет-Фактура - " + Стр._КолЭкзСФ + " экз.";
		КонецЕсли;
		
		Если Стр._КолЭкзТТН > 0 Тогда 
			ТабличныйДокумент = ТТН(МассивОбъектов);
			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент,МассивОбъектов);
			Распечатать(ТабличныеДокументы,СписокОбъектов,Стр._КолЭкзТТН,"ТТН");
			Текст = Текст + Символы.ПС + "ТТН - " + Стр._КолЭкзТТН + " экз.";
		КонецЕсли;
		
		Если Стр._КолЭкзСпецификация > 0 Тогда 
			ТабличныйДокумент = Спецификация(МассивОбъектов);
			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент,МассивОбъектов);
			Распечатать(ТабличныеДокументы,СписокОбъектов,Стр._КолЭкзСпецификация,"Спецификация");
			Текст = Текст + Символы.ПС + "спецификация - " + Стр._КолЭкзСпецификация + " экз.";
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
	КонецЦикла;
	
	Состояние();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаполнитьФорму()
	Документ = Неопределено;
	Параметры.Свойство("Документ",Документ);
	
	Если Документ = Неопределено Тогда
		ЗаполнитьТабОтгрузка();
	Иначе
		ЗаполнитьТабОтгрузкаПоВыделенномуДокументу(Документ);
	КонецЕсли;
КонецПроцедуры

// Заполнить таб отгрузка.
&НаСервере
Процедура ЗаполнитьТабОтгрузка()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОтгрузки",Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Дата КАК ДатаОтгрузки,
	|	Док.Дата КАК Дата,
	|	Док.Номер КАК Номер,
	|	Док.СуммаДокумента КАК Сумма,
	|	Док.Партнер КАК Клиент,
	|	Партнеры._КолЭкзСЧ КАК _КолЭкзСЧ,
	|	Партнеры._КолЭкзСФ КАК _КолЭкзСФ,
	|	Партнеры._КолЭкзТТН КАК _КолЭкзТТН,
	|	Партнеры._КолЭкзУПД КАК _КолЭкзУПД,
	|	Партнеры._КолЭкзТОРГ12 КАК _КолЭкзТОРГ12,
	|	Партнеры._КолЭкзСпецификация КАК _КолЭкзСпецификация,
	|	Партнеры._КолЭкзАктОРасхождениях КАК _КолЭкзАктОРасхождениях,
	|	Док.Ссылка КАК Реализация,
	|	Док.СпособДоставки КАК СпособДоставки,
	|	ЛогистЛист.Ссылка КАК ЛогистическийЛист,
	|	Партнеры.Наименование КАК ПорядокСортировки
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО Док.Партнер = Партнеры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Распоряжения КАК ЛогистЛист
	|		ПО Док.Ссылка = ЛогистЛист.Распоряжение
	|ГДЕ
	|	Док.Проведен
	|	И Док.AMS_СтатусРеализации = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Метка,
	|	вт.ДатаОтгрузки КАК ДатаОтгрузки,
	|	вт.Дата КАК Дата,
	|	вт.Номер КАК Номер,
	|	вт.Сумма КАК Сумма,
	|	вт.Клиент КАК Клиент,
	|	вт._КолЭкзСЧ КАК _КолЭкзСЧ,
	|	вт._КолЭкзСФ КАК _КолЭкзСФ,
	|	вт._КолЭкзТТН КАК _КолЭкзТТН,
	|	вт._КолЭкзУПД КАК _КолЭкзУПД,
	|	вт._КолЭкзТОРГ12 КАК _КолЭкзТОРГ12,
	|	вт._КолЭкзСпецификация КАК _КолЭкзСпецификация,
	|	вт._КолЭкзАктОРасхождениях КАК _КолЭкзАктОРасхождениях,
	|	вт.Реализация КАК Реализация,
	|	вт.СпособДоставки КАК СпособДоставки,
	|	вт.ЛогистическийЛист КАК ЛогистическийЛист,
	|	вт.ПорядокСортировки КАК ПорядокСортировки
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.ДатаОтгрузки МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОтгрузки, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОтгрузки, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокСортировки";
	
	Табл = РеквизитФормыВЗначение("Отгрузка");
	
	Табл.Очистить();
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Если Выб.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда 
			Стр = Табл.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Выб);
			
		Иначе
			Если ЗначениеЗаполнено(Выб.ЛогистическийЛист) И Выб.ЛогистическийЛист.Проведен Тогда 
				Стр = Табл.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,Выб);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Табл,"Отгрузка");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабОтгрузкаПоВыделенномуДокументу(Документ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ",Документ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК Метка,
	|	Док.Дата КАК ДатаОтгрузки,
	|	Док.Дата КАК Дата,
	|	Док.Номер КАК Номер,
	|	Док.СуммаДокумента КАК Сумма,
	|	Док.Партнер КАК Клиент,
	|	Партнеры._КолЭкзСЧ КАК _КолЭкзСЧ,
	|	Партнеры._КолЭкзСФ КАК _КолЭкзСФ,
	|	Партнеры._КолЭкзТТН КАК _КолЭкзТТН,
	|	Партнеры._КолЭкзУПД КАК _КолЭкзУПД,
	|	Партнеры._КолЭкзТОРГ12 КАК _КолЭкзТОРГ12,
	|	Партнеры._КолЭкзСпецификация КАК _КолЭкзСпецификация,
	|	Партнеры._КолЭкзАктОРасхождениях КАК _КолЭкзАктОРасхождениях,
	|	Док.Ссылка КАК Реализация,
	|	Док.СпособДоставки КАК СпособДоставки,
	|	ЛогистЛист.Ссылка КАК ЛогистическийЛист
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО Док.Партнер = Партнеры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Распоряжения КАК ЛогистЛист
	|		ПО Док.Ссылка = ЛогистЛист.Распоряжение
	|ГДЕ
	|	Док.Проведен
	|	И Док.AMS_СтатусРеализации = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке)
	|	И Док.Ссылка = &Документ";
	
	Табл = РеквизитФормыВЗначение("Отгрузка");
	
	Табл.Очистить();
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Если Выб.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда 
			Стр = Табл.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Выб);
			
		Иначе
			Если ЗначениеЗаполнено(Выб.ЛогистическийЛист) Тогда 
				Стр = Табл.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,Выб);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Табл,"Отгрузка");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерУПД(Реализация)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реализация,"Номер");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатаУПД(Реализация)
	Возврат Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реализация,"Дата"),"ДЛФ=Д");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСпособДоставки(Документ)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ,"СпособДоставки");
КонецФункции

&НаКлиенте
Процедура Распечатать(ТабличныеДокументы,МассивОбъектов,КоличествоЭкземпляров,НаименованиеДокумента)
	Для Экземпляр = 1 По КоличествоЭкземпляров Цикл
		УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(ТабличныеДокументы,  МассивОбъектов, Ложь, 1);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СкладскаяНакладная(МассивОбъектов)
	Возврат Обработки.AMS_Продажи.СформироватьПечатнуюФормуСН(МассивОбъектов,Новый СписокЗначений,Новый Структура);
КонецФункции

&НаСервере
Функция УПД(МассивОбъектов)
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		
	Возврат Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуУПД(СтруктураТипов, Новый СписокЗначений, Новый Структура("ТипПечати","АМС"));
КонецФункции

&НаСервере
Функция ТОРГ12(МассивОбъектов)
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТипПечати"     ,"АМС");
	ПараметрыПечати.Вставить("ВыводитьУслуги",Ложь);
	
	Возврат Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуТОРГ12(СтруктураТипов, Новый СписокЗначений, ПараметрыПечати);
КонецФункции

&НаСервере
Функция СчетФактура(МассивОбъектов)
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		
	Возврат Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуСчетФактура(СтруктураТипов, Новый СписокЗначений, Новый Структура("ПечатьВВалюте", Ложь));
КонецФункции

&НаСервере
Функция Счет(МассивОбъектов)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТипПечати","АМС");
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	
	Возврат Обработки.AMS_Продажи.СформироватьПечатнуюФормуСчетНаОплату(МассивОбъектов, Новый СписокЗначений, ПараметрыПечати);
КонецФункции

&НаСервере
Функция Доверенность(МассивОбъектов)
	Возврат Обработки.AMS_Продажи.СформироватьПечатнуюФормуДоверенность(МассивОбъектов, Новый СписокЗначений);
КонецФункции

&НаСервере
Функция ТТН(МассивОбъектов)
	Возврат Обработки.AMS_Продажи.СформироватьПечатнуюФормуТТН(МассивОбъектов, Новый СписокЗначений, Новый Структура());
КонецФункции

&НаСервере
Функция Спецификация(МассивОбъектов)
	Возврат Обработки.ПечатьОбщихФорм.амсСформироватьПечатнуюФормуСпецификации(МассивОбъектов, Новый СписокЗначений, Новый Структура());
КонецФункции

&НаСервере
Функция АктОРасхождениях(МассивОбъектов)
	Возврат Обработки.ПечатьОбщихФорм.амсСформироватьПечатнуюФормуАктОРасхождениях(МассивОбъектов, Новый СписокЗначений, Новый Структура());
КонецФункции

&НаСервере
Функция ТабличныеДокументыДляПечати(ПечатнаяФорма,МассивОбъектов)
	ТабличныеДокументы = Новый СписокЗначений;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(ПечатнаяФорма);
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ПечатнаяФорма, "АвтоМасштаб,Вывод,ВысотаСтраницы,ДвусторонняяПечать,Защита,ИмяПринтера,КодЯзыкаМакета,КоличествоЭкземпляров,МасштабПечати,ОриентацияСтраницы,ПолеСверху,ПолеСлева,ПолеСнизу,ПолеСправа,РазборПоКопиям,РазмерКолонтитулаСверху,РазмерКолонтитулаСнизу,РазмерСтраницы,ТочностьПечати,ЧерноБелаяПечать,ШиринаСтраницы,ЭкземпляровНаСтранице");
	ТабличныйДокумент.КоличествоЭкземпляров = 1;
	ТабличныеДокументы.Добавить(ТабличныйДокумент);
	
	Возврат ТабличныеДокументы;
КонецФункции

&НаСервере
Процедура ИзменитьРеквизитПартнера(Клиент,Реквизит,Значение)
	ПартнерОбъект = Клиент.ПолучитьОбъект();
	ПартнерОбъект[Реквизит] = Значение;
	ПартнерОбъект.Записать();
КонецПроцедуры

#КонецОбласти
